[
{"date": "February 17, 2021", "title": "LGT Navigator: Rising inflation expectations and higher bond yields take the momentum out of the stock market rally", "link": "https://www.lgt.at/en/news/lgt-navigator-rising-inflation-expectations-and-higher-bond-yields-take-the-momentum-out-of-the-stock-market-rally/", "content": "After the extended weekend, the friendly mood on the US stock markets continued on Tuesday and the indices reached record levels again, driven by unbroken optimism among investors. On the one hand, hopes are rising that the corona crisis will soon be overcome thanks to advancing vaccination campaigns and falling new Covid-19 infection figures, and on the other hand, capital markets continue to rely on fiscal and monetary stimulus from governments and central banks. Higher bond yields due to rising inflation expectations are providing a damper. After the indices on the New York Stock Exchange initially reached new record levels once again, the momentum was lost somewhat by the end of the trading day. The Dow Jones Industrial exceeded the mark of 31'600 points for the first time, but then gave up again and closed +0.2% higher at 31'522.75 points. The S&P 500 also initially climbed to a new high at 3'950.43 points, but ultimately showed a virtually unchanged from Friday at 3'932.59 points (-0.06%). As a damper proved the rise in US government bond yields, which reached the highest level in about a year. The background is rising inflation expectations as a result of the massive stimulus measures to contain the corona crisis. The focus is also on rising oil prices. Thus, the price of US WTI crude climbed to more than USD 60 per barrel. The winter storm in large parts of the United States and Texas in particular could affect production and logistics. In Washington, pressure is mounting on US Congress to finally pass the long-anticipated further corona stimulus package. In less than a month, millions of Americans will lose their unemployment benefits. This will also be the first major test for President Joe Biden, who is calling for a USD 1.9 trillion aid package. Biden is still hoping for a bipartisan agreement. However, the failed impeachment proceedings against former President Donald Trump have impressively shown that Republicans are unwilling to work together across party lines. While the Chinese stock exchanges remained closed today due to the New Year's holiday, the stock indices in Asia are trading inconsistently. In Tokyo, the Nikkei 225 loses -0.6%, while in Hong Kong, the Hang Seng increases by about 1.2%. On Europe's stock exchanges today should again focus on some important corporate reports, the US retail sales figures and the highly anticipated first speech of the new head of government Mario Draghi (10:00 CET). New York Empire State index points to continued recovery in the industrial sector Sentiment among industrial companies surveyed by the New York Fed brightened more than expected in February. The so-called Empire State index improved by 8.6 points to 12.1 points compared with the previous month. Analysts had forecast an average increase of 3.5 to 6.0 points. A reading above zero signals growth in the regional industrial sector. The barometer of the Federal Reserve of New York has now been in positive territory for eight months in a row. Investors more confident on their economic assessment according to ZEW survey According to the Mannheim-based Center for European Economic Research (ZEW), analysts' and investors' expectations for future economic development in Germany and the eurozone have improved noticeably. The ZEW indicator increased from 61.8 points in the previous month to 71.2 points in February, while analysts had expected a decline to 59.8 points against the background of the economic restrictions caused by the corona crisis. Consumption and trade in particular are expected to catch up significantly, although this will also raise inflation expectations, commented the ZEW. The economic indicator for the euro area climbed from 58.3 to 69.6 points. Meanwhile, Eurostat, the statistics authority, confirmed that economic output in the euro countries declined by -0.6% quarter-on-quarter in the final quarter of 2020, given the restrictions to combat the corona crisis. On an annual basis, the decline in gross domestic product in the fourth quarter was -5%. In 2020 as a whole, the pandemic caused the sharpest economic downturn in the history of the eurozone. GDP contracted by -6.8%. The slump was even steeper than the -4.5% recorded during the global financial crisis in 2009. Australia's central bank signals long-term loose monetary policy In its minutes of the February 2 meeting, the Reserve Bank of Australia (RBA) signaled its intention to keep interest rates at extremely low levels and continue bond purchases until inflation and wage growth pick up sustainably. In doing so, the RBA would also follow the monetary policy of other central banks in order to prevent an undesired appreciation of the Australian dollar. Economic Indicators February 17 MEZ Country Indicator Last 00:00 CN Holiday 08:00 UK Consumer Prices (January, y/y) +0.6% 08:00 UK Core Consumer Prices (January, y/y) +1.4% 14:30 US Retail Sales (January, m/m) -0.7% 14:30 US Producer Prices (January, y/y) +0.8% 14:30 US Core Producer Prices (January, y/y) +1.2% 15:15 US Industrial Production (December, m/m) +1.6% 16:00 US NAHB Housing Market Index (February) 83.0 20:00 US FOMC Minutes Earnings Calendar February 17 Country Corporate Period SZ Schindler Q4 GE Beiersdorf Q4 FR Kering Q4 FR Capgemini Q4 NL Ahold Q4 UK Rio Tinto Q4 UK BAT Q4 LGT helps you make informed investment decisions All about global economic and market trends at a glance Subscribe to LGT's research newsletters You can also follow us on Facebook or LinkedIn – or visit MAG/NET and discover interesting background articles. If you have questions, a consultant from the bank will be happy to help you. Imprint Publisher: LGT Bank (Switzerland) Ltd., Glärnischstrasse 36, CH-8027 Zurich Editor: Alessandro Fezzi, +41 44 250 78 59, E-Mail: lgt.navigator@lgt.com Source: LGT Bank (Switzerland) Ltd. Risk Disclosure (Disclaimer) This publication is an advertising material / marketing communication. This publication is for your information only and is not intended as an offer, solicitation of an offer, or public advertisement to buy or sell any investment or other specific product. Its content has been prepared by our staff and is based on sources of information we consider to be reliable. However, we cannot provide any confirmation or guarantee as to its being correct, complete and up to date. The circumstances and principles to which the information contained in this publication relates may change at any time. Information that has been published should therefore not be understood as implying that no change has taken place since its publication or that it is still up to date. The information in this publication does not constitute an aid for decision-making in relation to financial, legal, tax-related or other consulting matters, nor should any investment decisions or other decisions be made on the basis of this information alone. It is recommended that advice be obtained from a qualified expert. Investors should be aware that the value of investments can fall as well as rise. Positive performance in the past is therefore no guarantee of positive performance in the future. Investments in foreign currencies are also subject to fluctuations in exchange rates. We disclaim all liability for any loss or damage of any kind, whether direct, indirect or consequential, which may be incurred through the use of this publication. This publication is not intended for persons subject to legislation that prohibits its distribution or makes its distribution contingent upon an approval. Any person coming into possession of this publication shall therefore be obliged to find out about any restrictions that may apply and to comply with them. In line with internal guidelines, persons responsible for compiling this report are free to buy hold and sell the securities referred to in this report. US employment growth remains dynamic at the beginning of the year"},
{"date": "February 11, 2021", "title": "LGT Navigator: Stock markets take a breath", "link": "https://www.lgt.at/en/news/lgt-navigator-stock-markets-take-a-breath/", "content": "After the recent record chase, stock markets are trying to consolidate the higher valuation level. The main focus remains on the anticipated corona stimulus package in the US and the longer-term expansive orientation of central banks. Federal Reserve Chairman Powell reiterated that the economy needs further assistance in view of the corona crisis. While inflation expectations on financial markets have been rising for some time in view of the anticipated further expansion of fiscal policy measures to contain the economic impact of the pandemic, the current inflation rate in the US remained moderate at the beginning of the year. On Wall Street, the indices trended more or less sideways in midweek, with new highs again being recorded in some cases at the start of trading. The Dow Jones Industrial closed with a daily gain of +0.2% at 31'437.80 points, while the market-wide S&P 500 declined by -0.03% to 3'909.88 points and the technology stock index Nasdaq 100 by -0.23% to 13'655.27 points. On the corporate side, the quarterly figures of Coca-Cola, among others, made headlines in the pre-market after the beverage company exceeded analysts' expectations with its earnings per share. Meanwhile, Federal Reserve Chairman Jerome Powell maintained in a speech to the Economic Club of New York that the labor market is still far from a full recovery. Powell stressed that it will take more than supportive monetary policy to achieve and sustain maximum employment. In Asia, stock trading was quiet on Thursday due to holidays in Japan, Korea and China. For European stock markets, futures signal a friendly start. In addition to some corporate results, the latest economic forecasts of the EU Commission (11:00 CET), among other things, are in focus today. In November, the EU Commission had forecasted that the euro economy would grow +4.2% in 2021. US inflation rate unchanged in January, but inflation expectations rise While analysts had expected a rise in US consumer price inflation on a year-over-year basis, the inflation rate in January remained unchanged at +1.4% from the previous month. On a monthly basis, consumer prices rose by +0.3%. Excluding energy and food prices, which are often susceptible to fluctuations, the inflation rate actually declined to +1.4% in January from +1.6% in December. On the other hand, the billion-euro stimulus package expected on financial markets from the new administration under President Joe Biden is causing inflation expectations to rise. So far, however, the Fed has not (yet) shown any concern in this regard. Inflation rate in Germany picks up at the beginning of the year In Germany, consumer prices rose more strongly than expected in January. Compared with the same period a year earlier, the inflation rate increased +1.0%, or +1.6% on an EU harmonized basis. In December, consumer prices had fallen by -0.3% year-on-year. The Federal Statistical Office explained that the reduction in value added tax for a limited period of six months in mid-2020 had had a price-driving effect. Ifo expects renewed dampener for Germany's economy due to lockdown The Munich-based economic research institute Ifo believes that the renewed restrictions on public life to contain the corona pandemic will provide another damper on the German economy. According to the Ifo Institute's calculations, the closure of consumer-related service sectors could push German gross domestic product down by almost another percentage point in the first quarter of 2021. However, as the industrial and construction sectors continue to perform well, gross domestic product is likely to stagnate rather than decline at the start of the year, Ifo commented. Economic Indicators February 11 MEZ Country Indicator Last 00:00 CN Holiday 00:00 JP Holiday 11:00 EZ EU Comission Economic Forecastst 14:30 US Initial Jobless Claims (weekly) +779,000 20:00 US Fed Semi-annual Monetary Policy Report to the Senate Earnings Calendar February 11 Country Corporate Period SZ Zurich Insurance Q4 SZ Clariant Q4 FR L'Oréal Q4 FR Schneider Electric Q4 UK AstraZeneca Q4 US Walt Disney Q4 US PepsiCo Q4 LGT helps you make informed investment decisions All about global economic and market trends at a glance Subscribe to LGT's research newsletters You can also follow us on Facebook or LinkedIn – or visit MAG/NET and discover interesting background articles. If you have questions, a consultant from the bank will be happy to help you. Imprint Publisher: LGT Bank (Switzerland) Ltd., Glärnischstrasse 36, CH-8027 Zurich Editor: Alessandro Fezzi, +41 44 250 78 59, E-Mail: lgt.navigator@lgt.com Source: LGT Bank (Switzerland) Ltd. Risk Disclosure (Disclaimer) This publication is an advertising material / marketing communication. This publication is for your information only and is not intended as an offer, solicitation of an offer, or public advertisement to buy or sell any investment or other specific product. Its content has been prepared by our staff and is based on sources of information we consider to be reliable. However, we cannot provide any confirmation or guarantee as to its being correct, complete and up to date. The circumstances and principles to which the information contained in this publication relates may change at any time. Information that has been published should therefore not be understood as implying that no change has taken place since its publication or that it is still up to date. The information in this publication does not constitute an aid for decision-making in relation to financial, legal, tax-related or other consulting matters, nor should any investment decisions or other decisions be made on the basis of this information alone. It is recommended that advice be obtained from a qualified expert. Investors should be aware that the value of investments can fall as well as rise. Positive performance in the past is therefore no guarantee of positive performance in the future. Investments in foreign currencies are also subject to fluctuations in exchange rates. We disclaim all liability for any loss or damage of any kind, whether direct, indirect or consequential, which may be incurred through the use of this publication. This publication is not intended for persons subject to legislation that prohibits its distribution or makes its distribution contingent upon an approval. Any person coming into possession of this publication shall therefore be obliged to find out about any restrictions that may apply and to comply with them. In line with internal guidelines, persons responsible for compiling this report are free to buy hold and sell the securities referred to in this report. US employment growth remains dynamic at the beginning of the year"},
{"date": "February 16, 2021", "title": "LGT Navigator: Extended bull run on economic optimism", "link": "https://www.lgt.at/en/news/lgt-navigator-extended-bull-run-on-economic-optimism/", "content": "Falling new corona infection figures and a slowly progressing global vaccination campaign, as well as continuing hopes for the anticipated US government corona aid package and a recovery of the global economy, continue to ensure a buying mood and a solid start to the week on the stock exchanges. Even without any new impetus from Wall Street, which remained closed on Monday due to a holiday, the indices in Europe and Asia continued their rally. On the Tokyo Stock Exchange, the Nikkei 225 index was able to hold above the mark of 30'000 points and trades this morning around +1.3% higher than the previous day. In Hong Kong, the Hang Seng index is up around +1.7% and reached a 32-month high in the first trading session after the Lunar New Year holidays. However, the markets in mainland China remain closed until Thursday for the New Year holiday. In Europe, the new week also began with further gains. The EuroStoxx 50 closed +1.04% higher at 3'734.20 points, exiting trading near the day's high and trading just shy of pre-corona levels. The drivers continue to be expectations of further fiscal policy stimulus and a longer-term continued loose monetary policy of central banks. In addition, hopes currently prevail that the pandemic can be overcome through ongoing vaccinations and further approvals of new vaccines, thus consolidating the recovery of the global economy. The optimistic view is also causing bond yields to rise. The yield on ten-year US government bonds rose by around five basis points to 1.24% in Asian trading – the highest level since March last year. G7 seeks better cooperation on corona crisis Leaders of the seven leading industrialized nations, the G7, will focus their talks on combating the corona pandemic at a virtual conference on Friday (February 19). This was confirmed by British Prime Minister Boris Johnson, who currently holds the G7 presidency. Johnson wants to call on his colleagues to cooperate more closely, especially in the distribution of Corona vaccines. A “new, global approach“ must be taken in this regard, he said. For the first time, the new US President Joe Biden will also be present at a G7 summit. On the same day, Biden will also attend the virtual Munich Security Conference. Recovery in the euro area industrial sector loses momentum The industrial sector in the eurozone recorded a decline in production in December for the first time since last spring. On a monthly basis, production fell by -1.6%, twice as much as analysts had expected. After the massive slump in March and April 2020, output had risen for seven months in a row. Declining at the end of last year was mainly the production of capital goods, which fell by -3.1% month-on-month. Year-on-year, euro area output fell -0.8% in December (consensus -0.2%). Pandemic leaves skid marks on Europe's foreign trade Exports from the 19 euro area countries fell by -9.2% year-on-year last year, according to Eurostat, the statistics office. At the same time, imports fell by -10.8% compared to the previous year. In the trade balance, the surplus increased to EUR 234.5bn in the eurozone in 2020 as a whole, from EUR 221.0bn in the previous year. The main trading partner with the EU in 2020 was China. Imports from the People's Republic rose by +5.6% last year, while exports from the EU to China increased by +2.2%. In contrast, foreign trade with the US declined significantly. Exports from the EU to the United States fell by -8.2% and imports from the US to the EU fell by -13.2%. Economic Indicators February 16 MEZ Country Indicator Last 00:00 CN Holiday 11:00 GE ZEW Investors Economic Sentiment (February) 61.8 11:00 EZ GDP Q4 (q/q) -0.7% 14:30 US NY Fed Empire State Manufacturing Index (February) +3.5 Earnings Calendar February 17 Country Corporate Period SZ Schindler Q4 GE Beiersdorf Q4 FR Kering Q4 FR Capgemini Q4 NL Ahold Q4 UK Rio Tinto Q4 UK BAT Q4 LGT helps you make informed investment decisions All about global economic and market trends at a glance Subscribe to LGT's research newsletters You can also follow us on Facebook or LinkedIn – or visit MAG/NET and discover interesting background articles. If you have questions, a consultant from the bank will be happy to help you. Imprint Publisher: LGT Bank (Switzerland) Ltd., Glärnischstrasse 36, CH-8027 Zurich Editor: Alessandro Fezzi, +41 44 250 78 59, E-Mail: lgt.navigator@lgt.com Source: LGT Bank (Switzerland) Ltd. Risk Disclosure (Disclaimer) This publication is an advertising material / marketing communication. This publication is for your information only and is not intended as an offer, solicitation of an offer, or public advertisement to buy or sell any investment or other specific product. Its content has been prepared by our staff and is based on sources of information we consider to be reliable. However, we cannot provide any confirmation or guarantee as to its being correct, complete and up to date. The circumstances and principles to which the information contained in this publication relates may change at any time. Information that has been published should therefore not be understood as implying that no change has taken place since its publication or that it is still up to date. The information in this publication does not constitute an aid for decision-making in relation to financial, legal, tax-related or other consulting matters, nor should any investment decisions or other decisions be made on the basis of this information alone. It is recommended that advice be obtained from a qualified expert. Investors should be aware that the value of investments can fall as well as rise. Positive performance in the past is therefore no guarantee of positive performance in the future. Investments in foreign currencies are also subject to fluctuations in exchange rates. We disclaim all liability for any loss or damage of any kind, whether direct, indirect or consequential, which may be incurred through the use of this publication. This publication is not intended for persons subject to legislation that prohibits its distribution or makes its distribution contingent upon an approval. Any person coming into possession of this publication shall therefore be obliged to find out about any restrictions that may apply and to comply with them. In line with internal guidelines, persons responsible for compiling this report are free to buy hold and sell the securities referred to in this report. US employment growth remains dynamic at the beginning of the year"},
{"date": "February 15, 2021", "title": "LGT Navigator: Positive start to the week thanks to strong guidance from Tokyo", "link": "https://www.lgt.at/en/news/lgt-navigator-positive-start-to-the-week-thanks-to-strong-guidance-from-tokyo/", "content": "At the start of the week, the Nikkei index on the Tokyo Stock Exchange exceeded the 30'000 points mark for the first time in more than 30 years after the latest data confirmed that the recovery of the Japanese economy continued in the final quarter of 2020. While stock exchanges in the United States remain completely closed due to a holiday (George Washington Day), the European stock markets start the new trading week with a positive underlying sentiment. At the end of last week, the stock market indices in New York held close to the previously reached record highs. The Dow Jones closed little changed at 31'458.40 points (+0.09%) and the S&P 500 as well as the technology-heavy Nasdaq 100 gained +0.47% to 3'934.83 points, respectively +0.53% to 13'807.70 points. Still in focus is the hope for progress on the long-anticipated further corona stimulus package. It was also positively noted that the new US government has signed a contract for 100 million additional corona vaccine doses each with the manufacturers Moderna and Pfizer/BioNTech to promote the vaccination campaign. For Europe's stock exchanges, futures markets signaled a positive start to the week on Rosenmontag, which was clouded by the corona crisis, after the leading European index EuroStoxx 50 had already closed with a solid daily gain of +0.65% at 3'695.61 points on Friday. Today, the finance ministers of the 19 euro countries, the so-called Eurogroup, meet (from 15:00) and discuss the current economic development and the economic impact of the pandemic. The finance ministers also want to discuss how the euro can be further strengthened as a global currency in competition with the US dollar. Japan's economy continues recovery – Nikkei above 30'000 points The Japanese economy continued its recovery trend in the final quarter of 2020. According to preliminary data, GDP in the world's third-largest economy grew by +12.7% on an annualized basis, slightly more than analysts had expected. In the previous quarter, Japan's GDP had risen by a revised +22.7% on an annualized basis. It was the first time in three quarters that the country's economy grew again after Japan slipped into a severe recession in the wake of the corona crisis. However, for the full year 2020 the economy contracted by -4.8% – the first decline since 2009. On the Tokyo Stock Exchange, the data was received positively and the Nikkei index rose sharply by +1.91% and exceeded the important mark of 30'000 points. The index was boosted by the positive guidance from Wall Street and the news that Japan has granted approval to the corona vaccine of the US company Pfizer and BioNTech. Less than six months before the start of the Olympic Games in Tokyo, the vaccination campaign in Japan is now to begin immediately. Draghi to lead Italy out of corona crisis with expert government Former head of the European Central Bank Mario Draghi (73) is to lead Italy out of the corona crisis with a new government team. The new non-partisan head of government and his cross-party unity cabinet have started work in Rome. The main focus is on coping with the pandemic. To this end, the new government must submit plans to the EU in Brussels for the use of the EU corona aid. Americans look to the near future with concern Consumer sentiment in the US deteriorated unexpectedly in February. The consumer confidence barometer surveyed by the University of Michigan fell by -2.8 to 76.2 points compared with the previous month - the lowest value since August 2020. Analysts had expected an increase to 80.9 points. The expectations of private households in particular deteriorated significantly. Consumers now also increasingly expect inflation to rise. The indicator from the University of Michigan is based on a telephone survey of around 500 households. The respondents are asked about their assessment of the financial and economic situation and their expectations. Biden sets first cornerstones of his environmental policy Newly elected US President Joe Biden announced late last week that the Department of Energy would provide USD 100 million in funding to support low-carbon energy technologies. Overseeing the effort is the newly formed National Climate Task Force, which was created by Biden to combat climate change. He said the administration believes an aggressive shift to a clean energy economy can revitalize the US economy and create jobs. “We are positioning America to create good-paying, unionized jobs in an equitable way in communities across the country that will be at the forefront of new clean energy manufacturing and new technologies, tools and infrastructure that will help us adapt to a changing climate,“ the White House commented. Corona crisis sends UK economic performance plummeting in 2020 The British economy shrank dramatically last year as a result of the Covid-19 pandemic. According to the ONS statistics office in London, gross domestic product fell by -9.9% compared with the previous year. In particular, both household spending and business investment fell sharply in the corona year. Compared with the German economy, British GDP thus slumped twice as much. However, according to initial estimates, there are at least signs of a slight recovery in the UK in the final quarter of 2020. Economic Indicators February 15 MEZ Country Indicator Last 00:00 US, CAN, CN, HK Holiday 10:00 EZ Industrial Production (December, y/y) -0.6% 10:00 EZ Trade Balance (December) +EUR 25.8bn Earnings Calendar February 15 Country Corporate Period UK BHP Group Q4 LGT helps you make informed investment decisions All about global economic and market trends at a glance Subscribe to LGT's research newsletters You can also follow us on Facebook or LinkedIn – or visit MAG/NET and discover interesting background articles. If you have questions, a consultant from the bank will be happy to help you. Imprint Publisher: LGT Bank (Switzerland) Ltd., Glärnischstrasse 36, CH-8027 Zurich Editor: Alessandro Fezzi, +41 44 250 78 59, E-Mail: lgt.navigator@lgt.com Source: LGT Bank (Switzerland) Ltd. Risk Disclosure (Disclaimer) This publication is an advertising material / marketing communication. This publication is for your information only and is not intended as an offer, solicitation of an offer, or public advertisement to buy or sell any investment or other specific product. Its content has been prepared by our staff and is based on sources of information we consider to be reliable. However, we cannot provide any confirmation or guarantee as to its being correct, complete and up to date. The circumstances and principles to which the information contained in this publication relates may change at any time. Information that has been published should therefore not be understood as implying that no change has taken place since its publication or that it is still up to date. The information in this publication does not constitute an aid for decision-making in relation to financial, legal, tax-related or other consulting matters, nor should any investment decisions or other decisions be made on the basis of this information alone. It is recommended that advice be obtained from a qualified expert. Investors should be aware that the value of investments can fall as well as rise. Positive performance in the past is therefore no guarantee of positive performance in the future. Investments in foreign currencies are also subject to fluctuations in exchange rates. We disclaim all liability for any loss or damage of any kind, whether direct, indirect or consequential, which may be incurred through the use of this publication. This publication is not intended for persons subject to legislation that prohibits its distribution or makes its distribution contingent upon an approval. Any person coming into possession of this publication shall therefore be obliged to find out about any restrictions that may apply and to comply with them. In line with internal guidelines, persons responsible for compiling this report are free to buy hold and sell the securities referred to in this report. US employment growth remains dynamic at the beginning of the year"},
{"date": "February 12, 2021", "title": "LGT Navigator: Sideways at a high level", "link": "https://www.lgt.at/en/news/lgt-navigator-sideways-at-a-high-level/", "content": "Due to a lack of new impetus and the holidays in Asia, the stock markets are currently trending more or less sideways, but at a high and demanding level. After the recent series of records, a consolidation could form the basis for further gains. In Washington, meanwhile, the second impeachment trial against former President Trump is in the media spotlight. In New York, the stock indices were able to hold their ground not far from the recent record highs, supported by good demand for technology stocks. The Dow Jones Industrial initially even climbed again to a new high of 31'543 points, but then crumbled again and closed virtually unchanged from the previous day at 31'430.70 points (-0.02%). The S&P 500 exited the day's trading with a moderate gain of +0.17% at 3'916.38 points, while the technology index Nasdaq 100 gained +0.58% to 13'734.35 points. Futures suggest an opening at the previous day's level for Europe's stock markets after the EuroStoxx 50 posted a solid daily gain of +0.64% to 3671.68 points yesterday. This afternoon, investors are hoping for fresh impetus from the University of Michigan's survey results on consumer sentiment in the US. EU Commission slightly more optimistic on bottom line for euro economy In view of the renewed lockdowns as a result of the second wave of the pandemic in Europe, the EU Commission in Brussels now expects slightly lower economic growth in the eurozone in the current year. Accordingly, economic output in the euro area is expected to increase by +3.8% in 2021. In the previous forecast in November last year, GDP growth of +4.1% was still assumed. Next year, however, growth is also expected to be stronger at +3.8% than previously anticipated at +3.0%. All in all, the Commission is confident that the pre-crisis level will be reached more quickly than assumed in November. The slightly more optimistic stance is based primarily on the start of the Covid-19 vaccination campaigns, the multi-billion euro corona recovery fund and the conclusion of the Brexit trade pact with the UK. AstraZeneca to double Corona vaccine production British pharmaceutical company AstraZeneca is working to eliminate production problems and aims to double monthly output of its vaccine to 200 million doses by April. At the same time, it said it is also working to improve the vaccine to increase its effectiveness against viral mutations as well. No real easing in the US labor market in sight The number of initial claims for unemployment insurance in the United States decreased in the week ended February 6, but the previous week's reading was revised up significantly. Compared with the previous week, the number of claims fell by 19'000 to 793'000, the Labor Department reported. Analysts had forecast a sharper decline to 760'000. For the previous week, the figure was revised to 812'000 from the original 779'000. The four-week moving average decreased by 33'500 from the previous week to 823'000, leaving 4.55 million Americans receiving unemployment benefits in the week ended January 30 –145'000 less than the week before. Exploratory talks on a potential new center-right party in the US Discussions are apparently underway within the ranks of the Republican Party about a possible split to break away from “Trumpism.“ A potential new center-right party would pursue “principled conservatism“ while adhering to the Constitution and the rule of law. The talks underscore the wide intra-party divide in the wake of Trump's tenure and, more importantly, the storming of the US Capitol on January 6. In an initial digital conference, more than 120 Republicans, including former elected politicians and officials under Presidents Trump, George H.W. Bush, George W. Bush and Ronald Reagan, as well as former Republican ambassadors and strategists, are expected to attend, according to Reuters. Second impeachment trial – Trump's defense attorneys have their say After the arguments of the prosecutors, the defense lawyers of former President Donald Trump will present their views today. The trial could end as early as this weekend or early next week. A new acquittal of Trump seems highly likely in view of the majority in the Senate. A two-thirds majority in the Senate, which is necessary for a conviction, is not foreseeable. Nevertheless, the prosecutors had yesterday insistently demanded a conviction of the former US President. Trump had incited his supporters to violently storm the US Capitol on January 6 and this should not go unpunished. Economic Indicators February 12 MEZ Country Indicator Last 00:00 CN, HK, SING, SK Holiday 08:00 UK GDP Q4 (q/q) +16.0% 08:00 UK Industrial Production (December, y/y) -4.7% 08:30 SZ Consumer Prices (January, y/y) -0.8% 09:00 SP Consumer Prices (January, y/y) +0.6% 10:00 EZ Industrial Production (December, y/y) -0.6% 10:30 RUS Monetary Policy Announcement 4.25% 16:00 US Consumer Sentiment University of Michigan (February) 79.0 Earnings Calendar February 15 Country Corporate Period UK BHP Group Q4 LGT helps you make informed investment decisions All about global economic and market trends at a glance Subscribe to LGT's research newsletters You can also follow us on Facebook or LinkedIn – or visit MAG/NET and discover interesting background articles. If you have questions, a consultant from the bank will be happy to help you. Imprint Publisher: LGT Bank (Switzerland) Ltd., Glärnischstrasse 36, CH-8027 Zurich Editor: Alessandro Fezzi, +41 44 250 78 59, E-Mail: lgt.navigator@lgt.com Source: LGT Bank (Switzerland) Ltd. Risk Disclosure (Disclaimer) This publication is an advertising material / marketing communication. This publication is for your information only and is not intended as an offer, solicitation of an offer, or public advertisement to buy or sell any investment or other specific product. Its content has been prepared by our staff and is based on sources of information we consider to be reliable. However, we cannot provide any confirmation or guarantee as to its being correct, complete and up to date. The circumstances and principles to which the information contained in this publication relates may change at any time. Information that has been published should therefore not be understood as implying that no change has taken place since its publication or that it is still up to date. The information in this publication does not constitute an aid for decision-making in relation to financial, legal, tax-related or other consulting matters, nor should any investment decisions or other decisions be made on the basis of this information alone. It is recommended that advice be obtained from a qualified expert. Investors should be aware that the value of investments can fall as well as rise. Positive performance in the past is therefore no guarantee of positive performance in the future. Investments in foreign currencies are also subject to fluctuations in exchange rates. We disclaim all liability for any loss or damage of any kind, whether direct, indirect or consequential, which may be incurred through the use of this publication. This publication is not intended for persons subject to legislation that prohibits its distribution or makes its distribution contingent upon an approval. Any person coming into possession of this publication shall therefore be obliged to find out about any restrictions that may apply and to comply with them. In line with internal guidelines, persons responsible for compiling this report are free to buy hold and sell the securities referred to in this report. US employment growth remains dynamic at the beginning of the year"}
]